Edited/RestoreOutage.xml

<!-- edited with XMLSpy v2014 rel. 2 sp1 (x64) (http://www.altova.com) by Luis R. Malave (Milsoft Utility Solutions) -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Header>
		<MultiSpeakMsgHeader UserID="" Pwd="" xmlns="http://www.multispeak.org/Version_3.0"/>
	</soap:Header>
	<soap:Body>
		<RestoreOutage xmlns="http://www.multispeak.org/Version_3.0">
			<outageEventID>2014-02-06-0928</outageEventID>
			<eventTime>2014-02-06T04:10:10</eventTime>
			<callBackCustomersThatCalled>false</callBackCustomersThatCalled>
			<outageCause>
				<comments>tempory until underground conductor is fixed</comments>
				<outageReasonList>
					<outageReasonItem>
						<category>OutageCause</category>
						<outageReason>
							<description>999 Cause unknown</description>
							<outageReportingCodeList>
								<outageReportingCode reportingBody="Utility Defined"/>
								<outageReportingCode reportingBody="RUS1730A-119">999</outageReportingCode>
								<outageReportingCode reportingBody="IEEE P1782"/>
							</outageReportingCodeList>
						</outageReason>
					</outageReasonItem>
					<outageReasonItem>
						<category>EquipmentFailure</category>
						<outageReason>
							<description>490 Underground, other</description>
							<outageReportingCodeList>
								<outageReportingCode reportingBody="Utility Defined"/>
								<outageReportingCode reportingBody="RUS1730A-119">490</outageReportingCode>
								<outageReportingCode reportingBody="IEEE P1782"/>
							</outageReportingCodeList>
						</outageReason>
					</outageReasonItem>
					<outageReasonItem>
						<category>VoltageLevel</category>
						<outageReason>
							<description>003 15 KV</description>
							<outageReportingCodeList>
								<outageReportingCode reportingBody="Utility Defined"/>
								<outageReportingCode reportingBody="RUS1730A-119">003</outageReportingCode>
								<outageReportingCode reportingBody="IEEE P1782"/>
							</outageReportingCodeList>
						</outageReason>
					</outageReasonItem>
					<outageReasonItem>
						<category>WeatherCondition</category>
						<outageReason>
							<description>070 Extreme Cold</description>
							<outageReportingCodeList>
								<outageReportingCode reportingBody="Utility Defined"/>
								<outageReportingCode reportingBody="RUS1730A-119">070</outageReportingCode>
								<outageReportingCode reportingBody="IEEE P1782"/>
							</outageReportingCodeList>
						</outageReason>
					</outageReasonItem>
				</outageReasonList>
			</outageCause>
			<dispatcherResponsible>Barry Duncan</dispatcherResponsible>
		</RestoreOutage>
	</soap:Body>
</soap:Envelope>
